# Generic Zone Add Spaces Method

Source: https://www.revitapidocs.com/2026/a33fdc20-4691-29f1-e109-3758aed5922e.htm

---

| Generic Zone Add Spaces Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void AddSpaces(
	ISet<ElementId> spaceIds
)
```

```
Public Sub AddSpaces (
	spaceIds As ISet(Of ElementId)
)
```

```
public:
void AddSpaces(
	ISet<ElementId^>^ spaceIds
)
```

```
member AddSpaces :
        spaceIds : ISet<ElementId> -> unit
```

#### Parameters

spaceIds ISet ElementId

See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace